## Week 11, Lab 1: SQL Practice

> Author: Matt Brems

In this lab, you're going to have ten prompts. Each prompt will require you to do two things:
1. Write a SQL query.
2. Use the result of that query to answer the question.

The purpose of this lab is to get you to practice your SQL - an **important** skill in data science! While it is possible to get these answers using Pandas, it should be your goal to do everything only in SQL.

**Data**: The data used in this lab is the famous (but fake) Northwind database. It contains various tables of transactions. The schema for the Northwind database can be found [here](http://www.zentut.com/wp-content/uploads/downloads/2013/06/Northwind-Sample-Database-Diagram.pdf).

In [1]:
# Import Pandas and Create_Engine

import pandas as pd
from sqlalchemy import create_engine

# Set up the engine to access the data.
engine = create_engine('postgres://jlpmxjkftcsepc:bb9cd75e6659d7d67ee3b86be0f905069319c75bd6823d786c808dd799ea85a2@ec2-54-227-251-33.compute-1.amazonaws.com:5432/d9teltkv30dni7')

### Prompt 1

How many rows are there in the `customers` table of the Northwind database?

In [2]:
# Use a SQL query to find the answer to the above prompt.

sql = """
select count(*)
from customers
"""

display(pd.read_sql_query(sql, engine))

   count
0     91

**Prompt 1 Answer**: there are 91 rows

### Prompt 2

If you sort the customers in alphabetical order by name, which customer is fourth?

In [3]:
# Use a SQL query to find the answer to the above prompt.

sql = """
select *
from customers c
order by c.contact_name asc
limit 4
"""

display(pd.read_sql_query(sql, engine))

,customer_id,company_name,contact_name,contact_title,address,city,region,postal_code,country,phone,fax
0,ROMEY,Romero y tomillo,Alejandra Camino,Accounting Manager,"Gran Vía, 1",Madrid,None,28001,Spain,(91) 745 6200,(91) 745 6210
1,MORGK,Morgenstern Gesundkost,Alexander Feuer,Marketing Assistant,Heerstr. 22,Leipzig,None,04179,Germany,0342-023176,None
2,TRADH,Tradição Hipermercados,Anabela Domingues,Sales Representative,"Av. Inês de Castro, 414",Sao Paulo,SP,05634-030,Brazil,(11) 555-2167,(11) 555-2168
3,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745

**Prompt 2 Answer**: Ana Trujillo

### Prompt 3

Among those customers who live in Germany, if you sort the customers in alphabetical order by name, which customer is fourth?

In [10]:
# Use a SQL query to find the answer to the above prompt.


sql = """
select *
from customers 
where country = 'Germany'
order by contact_name asc
limit 4

"""

display(pd.read_sql_query(sql, engine))

,customer_id,company_name,contact_name,contact_title,address,city,region,postal_code,country,phone,fax
0,MORGK,Morgenstern Gesundkost,Alexander Feuer,Marketing Assistant,Heerstr. 22,Leipzig,None,04179,Germany,0342-023176,None
1,BLAUS,Blauer See Delikatessen,Hanna Moos,Sales Representative,Forsterstr. 57,Mannheim,None,68306,Germany,0621-08460,0621-08924
2,OTTIK,Ottilies Käseladen,Henriette Pfalzheim,Owner,Mehrheimerstr. 369,Köln,None,50739,Germany,0221-0644327,0221-0765721
3,QUICK,QUICK-Stop,Horst Kloss,Accounting Manager,Taucherstraße 10,Cunewalde,None,01307,Germany,0372-035188,None

**Prompt 3 Answer**: Horst Kloss

### Prompt 4

From the `employees` table, what are the first names of the individuals who have a birthdate in the 1960s?

In [63]:
# Use a SQL query to find the answer to the above prompt.

sql = """
select last_name, first_name, birth_date
from employees
where birth_date Between '1960-01-01' AND '1969-12-31'

"""

display(pd.read_sql_query(sql, engine))

   last_name first_name  birth_date
0  Leverling      Janet  1963-08-30
1     Suyama    Michael  1963-07-02
2       King     Robert  1960-05-29
3  Dodsworth       Anne  1966-01-27

**Prompt 4 Answer**:

### Prompt 5

In `order_details` table of the Northwind database, what is the total number of units sold for products 2, 3, and 4? 
> You should give us three numbers - one for each `ProductID`.

In [46]:
# Use a SQL query to find the answer to the above prompt.


sql = """
select sum(quantity), product_id
from order_details
where product_id between 2 and 4
group by product_id
order by product_id
"""

display(pd.read_sql_query(sql, engine))

    sum  product_id
0  1057           2
1   328           3
2   453           4

**Prompt 5 Answer**: product 2 sold 1057, product 3 sold 328, product 4 sold 453

### Prompt 6

From the `order_details` table of the Northwind database, calculate the revenue per product. In your SQL output, rename the revenue column `Revenue` and sort your results from largest revenue per product to smallest revenue per product. Which `ProductID` has the fifth-highest revenue, and what is that revenue rounded to the nearest dollar? 
> Note that revenue for a given product should be equal to the total unit price of that product times the quantity. You do not need to worry about the discount here. If you haven't multiplied columns together before, [this StackOverflow question](https://stackoverflow.com/questions/7536996/multiplying-two-columns-in-sql-server/7537059) may be helpful.

In [69]:
# Use a SQL query to find the answer to the above prompt.


sql = """
select cast(sum(quantity * unit_price) as int) revenue, product_id
from order_details
group by product_id
order by revenue desc

"""

df = (pd.read_sql_query(sql, engine))
df.head(5)

   revenue  product_id
0   149984          38
1    87736          29
2    76296          59
3    50286          60
4    49828          62

**Prompt 6 Answer**: 62 has the 5th highest revenue at $49,828

### Prompt 7

From the `products` table of the Northwind database, show the `ProductName`, `UnitsInStock`, and `UnitsOnOrder` values for those products who have more units on order than units in stock. Among these results, which product has the most units on order?

In [79]:
# Use a SQL query to find the answer to the above prompt.


sql = """
select product_name, units_in_stock, units_on_order
from products
where units_on_order > units_in_stock
order by units_on_order desc
"""

df = (pd.read_sql_query(sql, engine))
df.head()

                product_name  units_in_stock  units_on_order
0  Louisiana Hot Spiced Okra               4             100
1  Wimmers gute Semmelknödel              22              80
2          Gorgonzola Telino               0              70
3                Rogede sild               5              70
4              Aniseed Syrup              13              70

**Prompt 7 Answer**: Louisiana Hot Spiced Okra	has the most units on order at 100 units

### Prompt 8

From the `order_details` table, show the products that have an average discount of at least 8%. Among these results, which average discount is closest to 8%?

In [102]:
# Use a SQL query to find the answer to the above prompt.

sql = """
select avg(discount) avg_discount, product_id
from order_details
group by product_id
order by avg_discount desc
"""

df = (pd.read_sql_query(sql, engine))
df.head(8)

   avg_discount  product_id
0      0.108333          48
1      0.102273           2
2      0.100000           9
3      0.100000          58
4      0.086111          25
5      0.081250          30
6      0.079630          18
7      0.079032          36

**Prompt 8 Answer**: product 18 is closest to 8% for the average discount

### Prompt 9

Return the `orders` table, but also include the first name, last name, and country of the employee assigned to each order. What is the first and last name of the employee assigned to `OrderID` 11077? (This is the last row in the data, provided that you do not sort.)

In [111]:
# Use a SQL query to find the answer to the above prompt.

sql = """
select o.*, e.first_name, e.last_name, e.country
from orders o
inner join employees e on e.employee_id = o.employee_id
where order_id = 11077
"""

df = (pd.read_sql_query(sql, engine))
df

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country,first_name,last_name,country
0,11077,RATTC,1,1998-05-06,1998-06-03,None,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA,Nancy,Davolio,USA

**Prompt 9 Answer**: Nancy Davolio from the USA

### Prompt 10

Find the average amount of freight across all orders, broken out by country of *employee*. (**NOT `ShipCountry`**.) How much higher is the average freight from UK employees than the average freight from US employees?

> For a bonus, round the freight to the nearest whole number and rename the column `Average Freight`.

In [133]:
# Use a SQL query to find the answer to the above prompt.

sql = """
select cast(avg(o.freight) as int) Average_Freight, e.country
from orders o
inner join employees e on e.employee_id = o.employee_id
group by e.country
"""

df = (pd.read_sql_query(sql, engine))
df.head()

   average_freight country
0               79      UK
1               78     USA

**Prompt 10 Answer**: The average freight is 1 unit higher for UK employees